// AError.h: interface for the CAError class.
//
//////////////////////////////////////////////////////////////////////

#if !defined(AFX_AERROR_H__C9A1505C_8A74_4634_BE84_B73066C6AB3E__INCLUDED_)
#define AFX_AERROR_H__C9A1505C_8A74_4634_BE84_B73066C6AB3E__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000
class CAString;

class CAdoError;


class CAError  
{
public:
	CAError();
	virtual ~CAError();

protected:
	CAdoError	*m_pAdoError;

public:
	void		SetError(CAdoError *pAdoError);
	//==============================================
	// 所产生的错误代码
	//==============================================
	long		GetNumber();
	//==============================================
	// 产生错误的应用时式、或物件的名称
	//==============================================
	CAString		GetSource();
	//==============================================
	// 关于该项错误的描述文字
	//==============================================
	CAString		GetDescription();
	//==============================================
	// 这个主题说明文件路径路径
	//==============================================
	CAString		GetHelpFile();
	//==============================================
	// 这是一个长整数，用来搭配该项说明的主题
	//==============================================
	long		GetHelpContext();
	//==============================================
	// 「提供者」所指定的错误代码
	//==============================================
	long		GetNativeError();
	//==============================================
	// 这个错误产生时的 SQL 执行的状态
	//==============================================
	CAString		GetSQLState();
};

#endif // !defined(AFX_AERROR_H__C9A1505C_8A74_4634_BE84_B73066C6AB3E__INCLUDED_)
